proj1/app/controllers/books_controller.rb

  def index
    @l = Library.find(1)
---
SELECT `libraries`.* FROM `libraries` WHERE `libraries`.`id` = 1 LIMIT 1